app/controllers/projects_controller.rb

INSERT INTO `projects` (`created_at`, `description`, `name`, `updated_at`) VALUES ('2014-05-26 05:46:47', '<p>this is sample project</p>', 'project ', '2014-05-26 05:46:47')
---
  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save

UPDATE `projects` SET `avatar_content_type` = 'image/png', `avatar_file_name` = 'template_1120140529-3701-1fzhf0apng', `avatar_file_size` = 4103730, `avatar_updated_at` = '2014-05-29 05:47:26', `updated_at` = '2014-05-29 05:47:27' WHERE `projects`.`id` = 11
---
  def update
    respond_to do |format|
      if @project.update(project_params)